app/controllers/locations_controller.rb

SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @location = Location.find(params[:id])

INSERT INTO "locations" ("created_at", "location", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 04 Apr 2013 19:23:11 UTC +00:00], ["location", "Office"], ["updated_at", Thu, 04 Apr 2013 19:23:11 UTC +00:00]]
---
   def create
     @location = Location.new(params[:location])
     if @location.save