app/controllers/tapes_controller.rb

SELECT "tapes".* FROM "tapes" WHERE "tapes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @tape = Tape.find(params[:id])

SELECT "tapes".* FROM "tapes" WHERE "tapes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @tape = Tape.find(params[:id])

INSERT INTO "tapes" ("created_at", "description", "edited", "location_id", "number", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Thu, 04 Apr 2013 19:37:23 UTC +00:00], ["description", "farts"], ["edited", nil], ["location_id", "1"], ["number", 9], ["updated_at", Thu, 04 Apr 2013 19:37:23 UTC +00:00]]
---
  def create
    @tape = Tape.new(params[:tape])
    if @tape.save

SELECT "tapes".* FROM "tapes" WHERE "tapes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def print
    @tape = Tape.find(params[:id])

SELECT "tapes".* FROM "tapes" WHERE "tapes"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "tapes" SET "description" = 'Weekly 3-A March 2013', "updated_at" = '2013-03-20 21:47:56.695433' WHERE "tapes"."id" = 1
---
  def update
    @tape = Tape.find(params[:id])
    if @tape.update_attributes(params[:tape])

SELECT "tapes".* FROM "tapes" WHERE "tapes"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "tapes" WHERE "tapes"."id" = ?  [["id", 4]]
---
  def destroy
    @tape = Tape.find(params[:id])
    @tape.destroy

SELECT "tapes".* FROM "tapes" WHERE "tapes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def search
    @tape = Tape.find(params[:search])