app/controllers/versions_controller.rb

SELECT "versions".* FROM "versions" WHERE "versions"."id" = ? LIMIT 1  [["id", "40"]]
---
  def revert
    @version = Version.find(params[:id])