app/views/locations/index.html.erb

	<% @locations.each do |location| %>
	  <%= link_to "#{location.tapes.count}", location, class: "label" %> <%= link_to "#{location.location}", location %> <br />
---
SELECT "locations".* FROM "locations"
SELECT COUNT(*) FROM "tapes" WHERE "tapes"."location_id" = 1