app/views/locations/show.html.erb

SELECT "tapes".* FROM "tapes" WHERE "tapes"."location_id" = 4
---
	<br />
	<% @location.tapes.each do |tape| %>